Revit 2027 API
ParameterTypeId.StairsPathStartExtension Property
 "Start Extension"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsPathStartExtension { get; }
Public Shared ReadOnly Property StairsPathStartExtension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsPathStartExtension {
	ForgeTypeId^ get ();
}
static member StairsPathStartExtension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace